In [1086]:
import pandas as pd

In [1087]:
df = pd.read_csv("Salary_Data.csv")

In [1088]:
df

    YearsExperience    Salary
0               1.1   39343.0
1               1.3   46205.0
2               1.5   37731.0
3               2.0   43525.0
4               2.2   39891.0
5               2.9   56642.0
6               3.0   60150.0
7               3.2   54445.0
8               3.2   64445.0
9               3.7   57189.0
10              3.9   63218.0
11              4.0   55794.0
12              4.0   56957.0
13              4.1   57081.0
14              4.5   61111.0
15              4.9   67938.0
16              5.1   66029.0
17              5.3   83088.0
18              5.9   81363.0
19              6.0   93940.0
20              6.8   91738.0
21              7.1   98273.0
22              7.9  101302.0
23              8.2  113812.0
24              8.7  109431.0
25              9.0  105582.0
26              9.5  116969.0
27              9.6  112635.0
28             10.3  122391.0
29             10.5  121872.0

In [1089]:
df.shape

(30, 2)

In [1090]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30 entries, 0 to 29
Data columns (total 2 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   YearsExperience  30 non-null     float64
 1   Salary           30 non-null     float64
dtypes: float64(2)
memory usage: 608.0 bytes

In [1091]:
schema_df = pd.read_csv("Salary_Data.csv")

In [1092]:
schema_df

    YearsExperience    Salary
0               1.1   39343.0
1               1.3   46205.0
2               1.5   37731.0
3               2.0   43525.0
4               2.2   39891.0
5               2.9   56642.0
6               3.0   60150.0
7               3.2   54445.0
8               3.2   64445.0
9               3.7   57189.0
10              3.9   63218.0
11              4.0   55794.0
12              4.0   56957.0
13              4.1   57081.0
14              4.5   61111.0
15              4.9   67938.0
16              5.1   66029.0
17              5.3   83088.0
18              5.9   81363.0
19              6.0   93940.0
20              6.8   91738.0
21              7.1   98273.0
22              7.9  101302.0
23              8.2  113812.0
24              8.7  109431.0
25              9.0  105582.0
26              9.5  116969.0
27              9.6  112635.0
28             10.3  122391.0
29             10.5  121872.0

In [1093]:
df.head(10)

   YearsExperience   Salary
0              1.1  39343.0
1              1.3  46205.0
2              1.5  37731.0
3              2.0  43525.0
4              2.2  39891.0
5              2.9  56642.0
6              3.0  60150.0
7              3.2  54445.0
8              3.2  64445.0
9              3.7  57189.0

In [1094]:
pd.set_option('display.max_columns',2)
pd.set_option('display.max_columns',6)

In [1095]:
df.head()

   YearsExperience   Salary
0              1.1  39343.0
1              1.3  46205.0
2              1.5  37731.0
3              2.0  43525.0
4              2.2  39891.0

In [1096]:
person = {
    "first" : "corey",
    "last" : "Schafer",
    "email" : "CoreySchafer@gmail.com"
}

In [1097]:
people = {
    "first" : ["corey"],
    "last" : ["Schafer"],
    "email" : ["CoreySchafer@gmail.com"]
}

In [1098]:
people = {
    "first" : ["corey","John","Jone"],
    "last" : ["Schafer","Doe","Doe"],
    "email" : ["CoreySchafer@gmail.com","JohnDoe@gmail.com","JoneDoe@gmail.com"]
}

In [1099]:
people ['email']

['CoreySchafer@gmail.com', 'JohnDoe@gmail.com', 'JoneDoe@gmail.com']

In [1100]:
import pandas as pd

In [1101]:
df = pd.DataFrame(people)

In [1102]:
df

   first     last                   email
0  corey  Schafer  CoreySchafer@gmail.com
1   John      Doe       JohnDoe@gmail.com
2   Jone      Doe       JoneDoe@gmail.com

In [1103]:
df['email']

0    CoreySchafer@gmail.com
1         JohnDoe@gmail.com
2         JoneDoe@gmail.com
Name: email, dtype: object

In [1104]:
type(df['email'])

pandas.core.series.Series

In [1105]:
df.email

0    CoreySchafer@gmail.com
1         JohnDoe@gmail.com
2         JoneDoe@gmail.com
Name: email, dtype: object

In [1106]:
df [['last','email']]

      last                   email
0  Schafer  CoreySchafer@gmail.com
1      Doe       JohnDoe@gmail.com
2      Doe       JoneDoe@gmail.com

In [1107]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [1108]:
df.iloc[[0,1],2]

0    CoreySchafer@gmail.com
1         JohnDoe@gmail.com
Name: email, dtype: object

In [1109]:
df.loc[[0,1],['email','last']]

                    email     last
0  CoreySchafer@gmail.com  Schafer
1       JohnDoe@gmail.com      Doe

In [1110]:
df ['last'].value_counts

<bound method IndexOpsMixin.value_counts of 0    Schafer
1        Doe
2        Doe
Name: last, dtype: object>

In [1111]:
df

   first     last                   email
0  corey  Schafer  CoreySchafer@gmail.com
1   John      Doe       JohnDoe@gmail.com
2   Jone      Doe       JoneDoe@gmail.com

In [1112]:
df.set_index('email' , inplace=True)

In [1113]:
schema_df

    YearsExperience    Salary
0               1.1   39343.0
1               1.3   46205.0
2               1.5   37731.0
3               2.0   43525.0
4               2.2   39891.0
5               2.9   56642.0
6               3.0   60150.0
7               3.2   54445.0
8               3.2   64445.0
9               3.7   57189.0
10              3.9   63218.0
11              4.0   55794.0
12              4.0   56957.0
13              4.1   57081.0
14              4.5   61111.0
15              4.9   67938.0
16              5.1   66029.0
17              5.3   83088.0
18              5.9   81363.0
19              6.0   93940.0
20              6.8   91738.0
21              7.1   98273.0
22              7.9  101302.0
23              8.2  113812.0
24              8.7  109431.0
25              9.0  105582.0
26              9.5  116969.0
27              9.6  112635.0
28             10.3  122391.0
29             10.5  121872.0

Filtering
بستخدمها عشان احدد صفوف و اعمدة معينة استنادا ال شرط معين.

In [1114]:
people = {
    "first" : ["Corey","Jane","John"],
    "last" : ["Schafer","Doe","Doe"],
    "email" : ["CoreyMSchafer@gmail.com","JaneDoe@gmail.com","JohnDoe@gmail.com"]
}

In [1115]:
import pandas as pd

In [1116]:
df = pd.DataFrame(people)

In [1117]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@gmail.com
2   John      Doe        JohnDoe@gmail.com

In [1118]:
df['last'] == 'Doe' #لو اخر اسم يحتوى على doe هيطبع true

0    False
1     True
2     True
Name: last, dtype: bool

In [1119]:
filt = (df['last'] == 'Doe')

In [1120]:
df[filt]
# df[filt] = df[(df['last'] == 'Doe')]

  first last              email
1  Jane  Doe  JaneDoe@gmail.com
2  John  Doe  JohnDoe@gmail.com

In [1121]:
df.loc[filt, 'email']

1    JaneDoe@gmail.com
2    JohnDoe@gmail.com
Name: email, dtype: object

In [1122]:
df[filt] = df[(df['last'] == 'Doe') & (df['first'] == 'John')]

In [1123]:
df.loc[-filt, 'email'] # -filt :- الشرطة بتعكس المطلوب ف هيطبع عكس المطلوب

0    CoreyMSchafer@gmail.com
Name: email, dtype: object

Updating roews and columns

In [1124]:
people = {
    "first" : ["Corey","Jane","John"],
    "last" : ["Schafer","Doe","Doe"],
    "email" : ["CoreyMSchafer@gmail.com","JaneDoe@gmail.com","JohnDoe@gmail.com"]
}

In [1125]:
import pandas as pd

In [1126]:
df = pd.DataFrame(people)

In [1127]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@gmail.com
2   John      Doe        JohnDoe@gmail.com

In [1128]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [1129]:
df.columns = ['first_name' , 'last_name','email']

In [1130]:
df.columns

Index(['first_name', 'last_name', 'email'], dtype='object')

In [1131]:
df

  first_name last_name                    email
0      Corey   Schafer  CoreyMSchafer@gmail.com
1       Jane       Doe        JaneDoe@gmail.com
2       John       Doe        JohnDoe@gmail.com

In [1132]:
df.columns = [x.upper() for x in df.columns] #make columns name Capital
df

  FIRST_NAME LAST_NAME                    EMAIL
0      Corey   Schafer  CoreyMSchafer@gmail.com
1       Jane       Doe        JaneDoe@gmail.com
2       John       Doe        JohnDoe@gmail.com

In [1133]:
df.columns = df.columns.str.replace('_',' ')
df

  FIRST NAME LAST NAME                    EMAIL
0      Corey   Schafer  CoreyMSchafer@gmail.com
1       Jane       Doe        JaneDoe@gmail.com
2       John       Doe        JohnDoe@gmail.com

In [1134]:
df.columns = [x.lower() for x in df.columns] #make columns name Capital
df

  first name last name                    email
0      Corey   Schafer  CoreyMSchafer@gmail.com
1       Jane       Doe        JaneDoe@gmail.com
2       John       Doe        JohnDoe@gmail.com

In [1135]:
df.rename(columns={'first name':'first', 'last name':'last'}, inplace=True) #inplace : بعمل التغيير ده على البيانات الاصلية

In [1136]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@gmail.com
2   John      Doe        JohnDoe@gmail.com

In [1137]:
df.loc[2]

first                 John
last                   Doe
email    JohnDoe@gmail.com
Name: 2, dtype: object

In [1138]:
df.loc[2,'last'] = 'Smith' # == df.at[2,'last'] = 'smith

In [1139]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@gmail.com
2   John    Smith        JohnDoe@gmail.com

In [1140]:
filt = (df['email'] == 'JohnDoe@gmail.com')
df.loc[filt,'last'] == 'Doe'

2    False
Name: last, dtype: bool

In [1141]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@gmail.com
2   John    Smith        JohnDoe@gmail.com

In [1142]:
df['email'] = df['email'].str.lower()
df

   first     last                    email
0  Corey  Schafer  coreymschafer@gmail.com
1   Jane      Doe        janedoe@gmail.com
2   John    Smith        johndoe@gmail.com

In [1143]:
df['email'].apply(len)

0    23
1    17
2    17
Name: email, dtype: int64

In [1144]:
def update_email(email):
    return email.upper()

In [1145]:
df['email'].apply(update_email)

0    COREYMSCHAFER@GMAIL.COM
1          JANEDOE@GMAIL.COM
2          JOHNDOE@GMAIL.COM
Name: email, dtype: object

In [1146]:
df['email'] = df['email'].apply(update_email)
df

   first     last                    email
0  Corey  Schafer  COREYMSCHAFER@GMAIL.COM
1   Jane      Doe        JANEDOE@GMAIL.COM
2   John    Smith        JOHNDOE@GMAIL.COM

In [1147]:
df['email'] = df['email'].apply(lambda x: x.lower())

In [1148]:
df.apply(len,axis = 'columns')

0    3
1    3
2    3
dtype: int64

In [1149]:
df.apply(pd.Series.max)

first                 John
last                 Smith
email    johndoe@gmail.com
dtype: object

In [1150]:
df.apply(lambda x: x.min())

first                      Corey
last                         Doe
email    coreymschafer@gmail.com
dtype: object

In [1151]:
df.applymap(len)

   first  last  email
0      5     7     23
1      4     3     17
2      4     5     17

In [1152]:
df.applymap(str.upper)
df

   first     last                    email
0  Corey  Schafer  coreymschafer@gmail.com
1   Jane      Doe        janedoe@gmail.com
2   John    Smith        johndoe@gmail.com

In [1153]:
df['first'].map({"Corey":"Sohaila","Jane":"Jack"})

0    Sohaila
1       Jack
2        NaN
Name: first, dtype: object

In [1154]:
df['first'].replace({"Corey":"Sohaila","Jane":"Jack"})

0    Sohaila
1       Jack
2       John
Name: first, dtype: object

Add/Remove columns

In [1155]:
people = {
    "first" : ["Corey","Jane","John"],
    "last" : ["Schafer","Doe","Doe"],
    "email" : ["CoreyMSchafer@gmail.com","JaneDoe@gmail.com","JohnDoe@gmail.com"]
}

In [1156]:
import pandas as pd

In [1157]:
df = pd.DataFrame(people)

In [1158]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@gmail.com
2   John      Doe        JohnDoe@gmail.com

In [1159]:
df['first'] + ' ' + df['last']

0    Corey Schafer
1         Jane Doe
2         John Doe
dtype: object

In [1160]:
df['full_name'] = df['first'] + ' ' + df['last']
df

   first     last                    email      full_name
0  Corey  Schafer  CoreyMSchafer@gmail.com  Corey Schafer
1   Jane      Doe        JaneDoe@gmail.com       Jane Doe
2   John      Doe        JohnDoe@gmail.com       John Doe

In [1161]:
df.drop(columns=['first','last'] , inplace=True)

In [1162]:
df

                     email      full_name
0  CoreyMSchafer@gmail.com  Corey Schafer
1        JaneDoe@gmail.com       Jane Doe
2        JohnDoe@gmail.com       John Doe

In [1163]:
df['full_name'].str.split(' ',expand=True) # السطر هنا معناه قيم ال full_name قسمها على عمودين

       0        1
0  Corey  Schafer
1   Jane      Doe
2   John      Doe

In [1164]:
df['full_name'].str.split(' ',expand=False)

0    [Corey, Schafer]
1         [Jane, Doe]
2         [John, Doe]
Name: full_name, dtype: object

In [1165]:
df[['first','last']] = df['full_name'].str.split(' ',expand=True)
df

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@gmail.com       Jane Doe   Jane      Doe
2        JohnDoe@gmail.com       John Doe   John      Doe

In [1166]:
df.append({'first' : 'Tony'},ignore_index=True) # append = add new row , ignore_true = add new index with sequential integers

C:\Users\DELL\AppData\Local\Temp\ipykernel_33780\438232194.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df.append({'first' : 'Tony'},ignore_index=True) # append = add new row , ignore_true = add new index with sequential integers

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@gmail.com       Jane Doe   Jane      Doe
2        JohnDoe@gmail.com       John Doe   John      Doe
3                      NaN            NaN   Tony      NaN

In [1167]:
people = {
    'first':[ 'Tony','Steve'],
    'last':['Stark','Rogers'],
    'email' : ['IronMan@gmail.com','cap@gmail.com']
}

In [1168]:
df2 = pd.DataFrame(people)

In [1169]:
df = df.append(df2 , ignore_index=True, sort=False)
df

C:\Users\DELL\AppData\Local\Temp\ipykernel_33780\631775559.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df = df.append(df2 , ignore_index=True, sort=False)

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@gmail.com       Jane Doe   Jane      Doe
2        JohnDoe@gmail.com       John Doe   John      Doe
3        IronMan@gmail.com            NaN   Tony    Stark
4            cap@gmail.com            NaN  Steve   Rogers

In [1170]:
df.drop(index=4)

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@gmail.com       Jane Doe   Jane      Doe
2        JohnDoe@gmail.com       John Doe   John      Doe
3        IronMan@gmail.com            NaN   Tony    Stark

Sorting Data

In [1171]:
df.sort_values(by='last',ascending=False)

                     email      full_name  first     last
3        IronMan@gmail.com            NaN   Tony    Stark
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
4            cap@gmail.com            NaN  Steve   Rogers
1        JaneDoe@gmail.com       Jane Doe   Jane      Doe
2        JohnDoe@gmail.com       John Doe   John      Doe

In [1172]:
df.sort_index()

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@gmail.com       Jane Doe   Jane      Doe
2        JohnDoe@gmail.com       John Doe   John      Doe
3        IronMan@gmail.com            NaN   Tony    Stark
4            cap@gmail.com            NaN  Steve   Rogers

In [1173]:
df['last'].sort_values()

1        Doe
2        Doe
4     Rogers
0    Schafer
3      Stark
Name: last, dtype: object

Grouping and Aggregating